rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "NA"]]
---
  def same_director_movies
    @movie = Movie.find(params[:id])
    if @movie.director.nil?
      flash[:notice] = "'#{@movie.title}' has no director info'"
      redirect_to movies_path
    else
      @movies = Movie.where(director: @movie.director)